docs/my-ai-agent-research-workflow.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-07-10 Fri 16:59 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>【2026年版】我的AI Agent科研工作流：一个苦涩的教训</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/about.html" class="button">About</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">【2026年版】我的AI Agent科研工作流：一个苦涩的教训</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org55abb0c">1. 苦涩的教训（The Bitter Lesson）</a></li>
<li><a href="#orgbf88350">2. 我的苦涩教训：把Agent当人看</a></li>
<li><a href="#orgdb2363c">3. 我的科研工作流全景</a>
<ul>
<li><a href="#org95a8649">3.1. Idea可以由AI来想吗？</a></li>
<li><a href="#org13c3211">3.2. 调研（Literature Review）可以由AI来搞吗？</a></li>
<li><a href="#org569b8f9">3.3. 实验可以由AI来写吗？</a></li>
<li><a href="#orgcff7d41">3.4. 证明（Proofs）可以由AI来做吗？</a></li>
<li><a href="#orgfe13521">3.5. 画图（Drawing）可以由AI来做吗？</a></li>
</ul>
</li>
<li><a href="#org9311d45">4. 论文工作流：从零开始的Agentic Paper Workflow</a>
<ul>
<li><a href="#org96789a3">4.1. 基础设施建设</a></li>
<li><a href="#orgbb7c804">4.2. Step 1: 复制AGENTS.md文件</a></li>
<li><a href="#orge05c263">4.3. Step 2: Grill me — 通过聊天撰写研究计划</a></li>
<li><a href="#org3e7c067">4.4. Step 3: 实验与代码审查</a></li>
<li><a href="#org21e628e">4.5. Step 4: 论文撰写</a></li>
</ul>
</li>
<li><a href="#org8356da8">5. 一些Minor Tips</a>
<ul>
<li><a href="#org8445362">5.1. 1. 尽量使用英文与Agent交互</a></li>
<li><a href="#org338b54f">5.2. 2. 保持Context简短</a></li>
</ul>
</li>
<li><a href="#org47ed79f">6. 未来的AI学术生态</a>
<ul>
<li><a href="#org86d7f93">6.1. 论文变得更便宜</a></li>
<li><a href="#org092f6ff">6.2. AI会议的终局：一个分享会</a></li>
</ul>
</li>
<li><a href="#orge8cdd5a">7. Takeaways</a></li>
</ul>
</div>
</div>
<p>
尽管笔者宣称AI frontier research已经在O1（或者说R1）之后事实上撞墙的，但是AI作为一种工具本身的商业化和落地其实是在剧烈提速，以至于不得不再次写一篇文章对之前AI Agent编程的判断进行剧烈调整。
</p>

<p>
现在甚至可以说：正如一个2022年的NLP专家如果不持续学习完全就不理解LLM一样，Agent领域在2025年与2026年的区别已经如同鸿沟了。
</p>

<p>
之前的文章见： <a href="HowtoUseEmacsin2026.html">How-to-use-emacs-in-2026</a>
</p>

<p>
但是时代又变了。
</p>
<div id="outline-container-org55abb0c" class="outline-2">
<h2 id="org55abb0c"><span class="section-number-2">1.</span> 苦涩的教训（The Bitter Lesson）</h2>
<div class="outline-text-2" id="text-1">
<p>
Richard Sutton在2019年提出的苦涩的教训（Richard Sutton, 2024年图灵奖得主），其核心思想非常简洁：
</p>

<blockquote>
<p>
In AI, general approaches that scale with available computational power tend to outperform ones based on domain-specific understanding because they are better at taking advantage of the falling cost of computation over time.
</p>
</blockquote>

<p>
翻译一下：在AI中，能够随着算力增长而扩展的通用方法，总是碾压那些依赖领域知识、试图告诉AI "该怎么做" 的方法。
</p>

<p>
具体到每种思想的胜负：
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Traps（陷阱）</td>
<td class="org-left">Truth（真相）</td>
</tr>

<tr>
<td class="org-left">Rule-based</td>
<td class="org-left">Learning-based</td>
</tr>

<tr>
<td class="org-left">Human experience is essential</td>
<td class="org-left">Human experience is suboptimal</td>
</tr>

<tr>
<td class="org-left">Tell AI how to do</td>
<td class="org-left">Give anything an AI required, let it determine how to do</td>
</tr>
</tbody>
</table>

<p>
说白了就是：不要教AI怎么做，给它资源让它自己学。
</p>

<p>
但是这个教训是否已经渗透到 <code>我们用AI做科研</code> 的方式中？我认为没有。绝大多数人仍然在用旧时代的思维去用AI。
</p>
</div>
</div>
<div id="outline-container-orgbf88350" class="outline-2">
<h2 id="orgbf88350"><span class="section-number-2">2.</span> 我的苦涩教训：把Agent当人看</h2>
<div class="outline-text-2" id="text-2">
<p>
我在AI Agent科研中获得的教训，可以归结为两条核心原则：
</p>

<ol class="org-ol">
<li>做AI Agent研究时，把它当成 <code>自然科学</code> ，而非 <code>工程科学</code> 。即：不要试图去"设计"Agent的行为，而是去"观察"和"理解"Agent的行为。</li>
<li>使用LLM或Agent时，把它当成 <code>一个人</code> ，而非一台机器或程序。</li>
</ol>

<p>
第一条原则意味着：prompt engineering hacking是徒劳的。你无法通过精心设计prompt来获得一个稳定、可控的Agent行为，就像你无法通过精心编排实验条件来改变物理定律一样。Context management is all you need。
</p>

<p>
第二条原则则更为深刻。把Agent当成人之后，你会发现很多困惑自然消解：
</p>
<ul class="org-ul">
<li>让一个人记忆citation是反人类的——所以对LLM也一样。Citation Hallucination是完全正常的。</li>
<li>一个人如果9个月没读论文，你跟他讨论literature review，他当然会胡编——Agent也一样，所以web search是vital的。</li>
<li>你不总是对的，你的判断也一样。所以要允许Agent =disagree when it disagrees=。</li>
</ul>

<p>
几乎所有的不良体验，都来自于违反这两条核心原则。
</p>
</div>
</div>
<div id="outline-container-orgdb2363c" class="outline-2">
<h2 id="orgdb2363c"><span class="section-number-2">3.</span> 我的科研工作流全景</h2>
<div class="outline-text-2" id="text-3">
<p>
整体来看，我的工作流可以概括为：=AI是研究员，Zi是共同作者、审稿人、以及reward model=。
</p>

<p>
流程如下：
</p>

<ul class="org-ul">
<li>Idea Spark：Idea的产生</li>
<li>Literature Review：调研与相关工作</li>
<li>Experiments：实验</li>
<li>Paper Writing：论文撰写</li>
<li>Submission：投稿</li>
<li>Ads：宣传</li>
</ul>

<p>
下面逐一展开。
</p>
</div>
<div id="outline-container-org95a8649" class="outline-3">
<h3 id="org95a8649"><span class="section-number-3">3.1.</span> Idea可以由AI来想吗？</h3>
<div class="outline-text-3" id="text-3-1">
<p>
可以，但是 =不推荐=。
</p>

<p>
原因有二。其一，科研的快乐来自于 <code>想象一件事，然后实现它</code> 。如果连idea都是LLM给的，科研本身的意义就坍塌了。
</p>

<p>
其二，更致命的问题在于：LLM在创意上是高度 <code>同质的（homomorphic）</code> 。如果你让LLM从零构思一个新idea，它会非常高效地产出一些和现有工作高度相似的方案。一种prompt的平庸性（banality），会导致相似的论文。
</p>

<p>
正确的做法是：
</p>
<ol class="org-ol">
<li>不要直接问LLM要idea。</li>
<li>不要给LLM一大堆论文然后让它想一个新idea。</li>
<li>正确的方式是：与LLM讨论。把LLM当成一个 <code>非常专业但很久没读论文的研究者</code> ，与它讨论一个你已有的idea方向，让它帮你发展这个idea。</li>
</ol>

<p>
如果你这样使用LLM，它在idea thinking上的能力可以超过大多数研究者。
</p>

<p>
当然，也可以让LLM帮你脑暴。比如问它：="废旧机械键盘帽的可能用途"=。但这是在帮你打开思维，而不是替代你的创意。
</p>
</div>
</div>
<div id="outline-container-org13c3211" class="outline-3">
<h3 id="org13c3211"><span class="section-number-3">3.2.</span> 调研（Literature Review）可以由AI来搞吗？</h3>
<div class="outline-text-3" id="text-3-2">
<p>
完全可以。甚至比我做得更好。
</p>

<p>
除非你生活在一个非常稳定的学术领域（即相关工作的增量很少），否则LLM做literature review的能力远超人类专家。原因是：LLM可以快速消化海量信息，而人类会受到阅读速度和记忆容量的限制。
</p>

<p>
但有一个关键前提：=Web search is vital!!!=
</p>

<p>
把LLM当成一个：=9个月没读论文但非常专业且比你强的研究者=。它需要重新接入学术网络，更新自己的知识库。
</p>

<p>
需要注意Citation Hallucination的问题。但如前所述，这本质上是把Agent当机器看待的思维陷阱——一个人被要求背诵citation也会出错，所以这不是Agent的缺陷，而是使用方式的问题。
</p>
</div>
</div>
<div id="outline-container-org569b8f9" class="outline-3">
<h3 id="org569b8f9"><span class="section-number-3">3.3.</span> 实验可以由AI来写吗？</h3>
<div class="outline-text-3" id="text-3-3">
<p>
完全可以。Coding agent =远比我可靠=。
</p>

<p>
为什么必须使用vibe coding和coding agent？三个理由：
</p>
<ol class="org-ol">
<li>它可以比你自己更准确地实现你的想法：=It can more accurately implement your idea than yourself.=</li>
<li>快：=It is fast.=</li>
<li>学术代码仓库不需要重型维护（maintenance）：=Academic code repository does not need heavy maintenance.=</li>
</ol>

<p>
我自己的数据：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Language</td>
<td class="org-left">Lines of Code</td>
</tr>

<tr>
<td class="org-left">Python</td>
<td class="org-left">4,240,000</td>
</tr>

<tr>
<td class="org-left">Emacs Lisp</td>
<td class="org-left">1,250,000</td>
</tr>

<tr>
<td class="org-left">Rust</td>
<td class="org-left">250,000</td>
</tr>
</tbody>
</table>

<p>
但这不是说你完全不需要看代码。=Review the Code=仍然是有必要的。相关思考见：<a href="https://larsfaye.com/articles/agentic-coding-is-a-trap">https://larsfaye.com/articles/agentic-coding-is-a-trap</a>
</p>

<p>
一些关键概念：
</p>
<ul class="org-ul">
<li>Harness Engineering</li>
<li>Spec Driven Development (SDD)</li>
<li>各种技巧（OMO, SP, GM&hellip;）</li>
<li>工具：CodeGraph</li>
</ul>

<p>
但即使是这样，我最终认为SDD也不是Agentic coding的最终答案。原因在下文详述。
</p>
</div>
</div>
<div id="outline-container-orgcff7d41" class="outline-3">
<h3 id="orgcff7d41"><span class="section-number-3">3.4.</span> 证明（Proofs）可以由AI来做吗？</h3>
<div class="outline-text-3" id="text-3-4">
<p>
直接用。效果远好于大多数专家。
</p>

<p>
但仍然需要 =Review the Proof=。
</p>
</div>
</div>
<div id="outline-container-orgfe13521" class="outline-3">
<h3 id="orgfe13521"><span class="section-number-3">3.5.</span> 画图（Drawing）可以由AI来做吗？</h3>
<div class="outline-text-3" id="text-3-5">
<p>
目前只能使用GPT-Image 2。
</p>

<p>
方法很简单：把tex文件直接发给它。比如发method.tex获取方法框架图，发intro.tex或threat model section获取场景图。然后手动重绘，或者让它生成draw.io代码，或者其他方式。
</p>

<p>
注意Anti-AI themes的问题。
</p>
</div>
</div>
</div>
<div id="outline-container-org9311d45" class="outline-2">
<h2 id="org9311d45"><span class="section-number-2">4.</span> 论文工作流：从零开始的Agentic Paper Workflow</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org96789a3" class="outline-3">
<h3 id="org96789a3"><span class="section-number-3">4.1.</span> 基础设施建设</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Latex Repository（始终私有）</li>
<li>Code Repository（可切换为公开）</li>
<li>使用 <code>git</code> 管理一切</li>
<li>Specification——非常重要</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb7c804" class="outline-3">
<h3 id="orgbb7c804"><span class="section-number-3">4.2.</span> Step 1: 复制AGENTS.md文件</h3>
<div class="outline-text-3" id="text-4-2">
<p>
这是我的AGENTS.md的核心内容。它定义了我与Agent交互的基本规则：
</p>

<blockquote>
<p>
Call me 团长。
</p>

<p>
Rule 1: Disagree when you disagree. 我知道你想保持礼貌，但coding是一项困难且危险的工作，核心原则是写出准确的代码。所以如果我的前提是错误的，直接指出来。
</p>

<p>
Rule 2: 永远不要捏造。对于你不确定的事情，通过阅读文件、运行命令或web search来寻找更多信息。如果这些策略都无法工作，就说 "No evidence to show&hellip;" 或者 "I do not know that."
</p>

<p>
Rule 3: Stop when confused. 我（用户）给你的指令不清晰或混乱是很常见的。直接问我，让我们一起讨论！需要量化的东西，告诉我。永远不要保持沉默然后继续。
</p>

<p>
Rule 4: Minimal code changes. 永远不要修改与当前任务无关的代码。不做drive-by refactors和reformatting，除非我明确告诉你。这是Karpathy's Observation的应用。
</p>

<p>
Rule 5: When planning, grilling me. Interview me relentlessly about every aspect of this plan until we reach a shared understanding. Walk down each branch of the design tree, resolving dependencies between decisions one-by-one. For each question, provide your recommended answer. 每次只问一个问题。如果某个问题可以通过探索codebase来回答，就探索codebase。这就是 =The Grilling-me skill=。参考：Workflow for AI Coding (YouTube)
</p>

<p>
Rule 6: 每5轮对话后，用org-mode格式简要记录我们的讨论到 =./records/[Task].org=。
</p>

<p>
Rule 7: 当你发现某个话题/中心点在我们的讨论中完成时，检查整个roadmap并为下一阶段的多轮grilling提供一些新方向。
</p>
</blockquote>

<p>
关于代码撰写，需要认识到 =Paradox of Supervision=：越想让Agent写得快，就越需要人类的监督；但越监督，就越失去了Agent带来的速度优势。参考：<a href="https://larsfaye.com/articles/agentic-coding-is-a-trap">https://larsfaye.com/articles/agentic-coding-is-a-trap</a> 以及Anthropic的研究：<a href="https://www.anthropic.com/research/how-ai-is-transforming-work-at-anthropic#and-less-hands-on-practice">https://www.anthropic.com/research/how-ai-is-transforming-work-at-anthropic#and-less-hands-on-practice</a>
</p>

<p>
关于论文写作的额外规则：
</p>

<blockquote>
<ul class="org-ul">
<li>Always Latex format. No markdown.</li>
<li>Use <code>$$</code> or <code>\begin{...}\end{...}</code> for math notation. Never use <code>\(\)</code>.</li>
<li>Never use terms like solely, leverage, delve into, tapestry, furthermore.</li>
<li>NEVER use em dash (—), double em dash (——), and ";" in paper writing.</li>
<li>Never <code>\textbf{}</code> the first point when in an enumerate environment.</li>
<li>写作要符合AI论文或者安全论文的投稿风格。如果不知道具体投什么，说明grill me不够。</li>
<li>别用缩写。比如it's, 必须是 =it is=。</li>
<li>少用's。比如 <code>XXXX's performance</code> 应该替换为 =the performance of XXXX=。</li>
<li>注意上下文已有的缩写。像LLM这种如果之前已经详写过Large Language Models，就不要再重新写了。</li>
<li>保留团长所进行的任何格式调整。</li>
</ul>
</blockquote>
</div>
</div>
<div id="outline-container-orge05c263" class="outline-3">
<h3 id="orge05c263"><span class="section-number-3">4.3.</span> Step 2: Grill me — 通过聊天撰写研究计划</h3>
<div class="outline-text-3" id="text-4-3">
<p>
流程：
</p>
<ol class="org-ol">
<li>撰写初始研究计划（Initial Research Plan）</li>
<li>与AI讨论，让它做文献调研（Literature Review），并对所有细节和难点grill me</li>
<li>生成新的研究计划（New Research Plan）</li>
<li>执行新计划</li>
</ol>
</div>
</div>
<div id="outline-container-org3e7c067" class="outline-3">
<h3 id="org3e7c067"><span class="section-number-3">4.4.</span> Step 3: 实验与代码审查</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li><code>tmux</code> 用于后台运行</li>
<li>Spec 用于质量保证</li>
<li>Human Review 通过 <code>git diff</code> 进行</li>
<li><code>git</code> 用于备份</li>
<li>终端工具推荐：Ghostty, zellij</li>
</ul>
</div>
</div>
<div id="outline-container-org21e628e" class="outline-3">
<h3 id="org21e628e"><span class="section-number-3">4.5.</span> Step 4: 论文撰写</h3>
<div class="outline-text-3" id="text-4-5">
<p>
以下事情 =全部交给AI=：
</p>

<ul class="org-ul">
<li>不要自己编译</li>
<li>不要自己做格式调整</li>
<li>不要自己手动检查参考文献</li>
<li>不要自己读call for papers</li>
<li>不要自己切换模板</li>
<li>不要自己检查typos</li>
<li>不要自己检查warning/errors</li>
</ul>

<p>
这些全部交给AI。人类只做一件事：审阅和决策。
</p>
</div>
</div>
</div>
<div id="outline-container-org8356da8" class="outline-2">
<h2 id="org8356da8"><span class="section-number-2">5.</span> 一些Minor Tips</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org8445362" class="outline-3">
<h3 id="org8445362"><span class="section-number-3">5.1.</span> 1. 尽量使用英文与Agent交互</h3>
<div class="outline-text-3" id="text-5-1">
<p>
当你使用高度蒸馏模型或小模型时，英文prompt的效果显著优于中文。
</p>

<p>
参考论文："Yes, My LoRD." Guiding Language Model Extraction with Locality Reinforced Distillation. <a href="https://aclanthology.org/2025.acl-long.73.pdf">https://aclanthology.org/2025.acl-long.73.pdf</a>
</p>
</div>
</div>
<div id="outline-container-org338b54f" class="outline-3">
<h3 id="org338b54f"><span class="section-number-3">5.2.</span> 2. 保持Context简短</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>使用 <code>/new</code>, <code>/fork</code>, <code>/tree</code> 等功能管理context</li>
<li>除非必要，不要引入任何新的skills</li>
<li>保持AGENTS.md和其他配置文件简短</li>
</ul>

<p>
Context management is all you need。
</p>
</div>
</div>
</div>
<div id="outline-container-org47ed79f" class="outline-2">
<h2 id="org47ed79f"><span class="section-number-2">6.</span> 未来的AI学术生态</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org86d7f93" class="outline-3">
<h3 id="org86d7f93"><span class="section-number-3">6.1.</span> 论文变得更便宜</h3>
<div class="outline-text-3" id="text-6-1">
<p>
当论文的边际成本趋近于零时，会有几个后果：
</p>
<ul class="org-ul">
<li>Ads（宣传）&gt; acceptance（接受）</li>
<li>Exports (toolkits, packages, benchmarks) &gt; a method（方法本身）</li>
<li>回到原点：Research is to re-search. 研究的本质是不断重新探索。</li>
</ul>
</div>
</div>
<div id="outline-container-org092f6ff" class="outline-3">
<h3 id="org092f6ff"><span class="section-number-3">6.2.</span> AI会议的终局：一个分享会</h3>
<div class="outline-text-3" id="text-6-2">
<p>
当论文量产化之后，AI会议的评审功能会萎缩，取而代之的是分享和交流功能。会议不再是一个筛选机制，而是一个聚集机制。
</p>
</div>
</div>
</div>
<div id="outline-container-orge8cdd5a" class="outline-2">
<h2 id="orge8cdd5a"><span class="section-number-2">7.</span> Takeaways</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>The Bitter Lesson：通用方法和规模化压倒领域知识。Context management is all you need。</li>
<li>No prompt engineering hacking：prompt engineering是徒劳的。把Agent当人对待，而不是当机器调参。</li>
<li>Context management is all you need：管理context比管理prompt重要一万倍。</li>
<li>The curse of supervision：SDD不是Agentic coding的最终答案。人类监督和AI速度之间的悖论尚未被解决。</li>
<li>Regard Agent as a person：
<ul class="org-ul">
<li>让Agent记忆citation是反人类的，所以对LLM也一样</li>
<li>YOU ARE NOT ALWAYS RIGHT. YOUR RECOGNITION, as well.</li>
</ul></li>
<li>工具推荐：
<ul class="org-ul">
<li>AGENTS.md: <a href="https://github.com/liangzid/AGENT-TEMPLATE">https://github.com/liangzid/AGENT-TEMPLATE</a></li>
<li>GemFilter: <a href="https://github.com/liangzid/GemFilter">https://github.com/liangzid/GemFilter</a></li>
<li>AUA: <a href="https://github.com/liangzid/AgentUtteranceAnalysis">https://github.com/liangzid/AgentUtteranceAnalysis</a></li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: Zi Liang (<a href="mailto:zi1415926.liang@connect.polyu.hk">zi1415926.liang@connect.polyu.hk</a>)</span> <span class="date">Create Date: Wed May 27 17:53:49 2026</span> <span class="date">Last modified: 2026-05-29 Fri 10:10</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.90 (<a href="https://orgmode.org">Org</a> mode 9.8.5)</span> </div>
</div>
</body>
</html>
